/**
 ****************************************************************************************************
 * @file        appplay_wlvideo.h
 * @version     V1.0
 * @brief       APP-无线视频传输 代码(待用户自己实现)
 ****************************************************************************************************
 * @attention   Waiken-Smart 慧勤智远
 *
 * 实验平台:    GD32H759IMT6小系统板
 *
 ****************************************************************************************************
 */
 
#ifndef __APPPLAY_WLVIDEO_H
#define __APPPLAY_WLVIDEO_H

#include "common.h"  


uint8_t appplay_wlvideo(uint8_t* caption); 
#endif



