/**
 ****************************************************************************************************
 * @file        notepad.h
 * @version     V1.0
 * @brief       APP-记事本 代码
 ****************************************************************************************************
 * @attention   Waiken-Smart 慧勤智远
 *
 * 实验平台:    慧勤智远 STM32开发板
 *
 ****************************************************************************************************
 */

#ifndef __NOTEPAD_H
#define __NOTEPAD_H

#include "common.h"


/* 定义最大的编辑长度.也就是新建文本文件的大小.或者打开一个旧文件后最大允许增加的长度 */
#define     NOTEPAD_EDIT_LEN    2048


void notepad_new_pathname(uint8_t *pname);
uint8_t notepad_play(void);

#endif







