/**
 ****************************************************************************************************
 * @file        webcamera.h
 * @version     V1.0
 * @brief       APP-网络摄像头代码
 ****************************************************************************************************
 * @attention   Waiken-Smart 慧勤智远
 *
 * 实验平台:    GD32H759IMT6小系统板
 *
 ****************************************************************************************************
 */

#ifndef __WEBCAMERA_H
#define __WEBCAMERA_H 

#include "netplay.h" 


#define WEBCAM_FIFO_NUM         100     //定义FIFO数量
#define WEBCAM_LINE_SIZE        4096    //定义行大小(*4字节)

 
uint8_t webcam_play(void);
#endif

