/**
 ****************************************************************************************************
 * @file        timer.h
 * @version     V1.0
 * @brief       定时器 驱动代码
 ****************************************************************************************************
 * @attention   Waiken-Smart 慧勤智远
 *
 * 实验平台:    STM32H747XIH6小系统板
 *
 ****************************************************************************************************
 */

#ifndef __TIM_H
#define __TIM_H

#include "./SYSTEM/sys/sys.h"


/* LCD PWM背光设置 */
#define LCD_BLPWM_VAL          TIM3->CCR3

/******************************************************************************************/

void tim8_int_init(uint16_t arr, uint16_t psc);         /* 定时器TIM8 定时中断初始化函数 */
void tim6_int_init(uint16_t arr, uint16_t psc);         /* 定时器TIM6 定时中断初始化函数 */
void tim3_ch3_pwm_init(uint16_t arr, uint16_t psc);     /* 定时器TIM3 CH3 PWM输出初始化函数 */

#endif





