/**
 ****************************************************************************************************
 * @file        timer.h
 * @version     V1.0
 * @brief       定时器中断 驱动代码
 ****************************************************************************************************
 * @attention   Waiken-Smart 慧勤智远
 *
 * 实验平台:    STM32H747XIH6小系统板
 *
 ****************************************************************************************************
 */

#ifndef __TIM_H
#define __TIM_H

#include "./SYSTEM/sys/sys.h"


/******************************************************************************************/
/* 定时器 定义 */

/* TIMX 中断定义 
 * 注意: 通过修改这4个宏定义,可以支持TIM1~TIM8/TIM12~TIM17任意一个定时器.
 */
 
#define TIMX_INT                       TIM6
#define TIMX_INT_IRQn                  TIM6_DAC_IRQn
#define TIMX_INT_IRQHandler            TIM6_DAC_IRQHandler
#define TIMX_INT_CLK_ENABLE()          do{ RCC->APB1LENR  |= 1 << 4; }while(0) /* TIM6 时钟使能 */

/******************************************************************************************/

void timx_int_init(uint32_t arr, uint16_t psc);          /* 定时器TIMX 定时中断初始化函数 */
void btim_tim7_int_init(uint16_t arr, uint16_t psc);     /* 基本定时器7 定时中断初始化函数 */

#endif





