/**
 ****************************************************************************************************
 * @file        wirelessplay.h
 * @version     V1.0
 * @brief       APP-无线通信测试 代码
 ****************************************************************************************************
 * @attention   Waiken-Smart 慧勤智远
 *
 * 实验平台:    慧勤智远 STM32开发板
 *
 ****************************************************************************************************
 */
 
#ifndef __WIRELESSPLAY_H
#define __WIRELESSPLAY_H

#include "common.h"

uint8_t wireless_play(void);

#endif











