/**
 ****************************************************************************************************
 * @file        appplay_remote.h
 * @version     V1.0
 * @brief       APP-红外遥控器 代码
 ****************************************************************************************************
 * @attention   Waiken-Smart 慧勤智远
 *
 * 实验平台:    GD32H759IMT6小系统板
 *
 ****************************************************************************************************
 */

#ifndef __APPPLAY_REMOTE_H
#define __APPPLAY_REMOTE_H

#include "common.h"


uint8_t appplay_remote(uint8_t* caption); 
#endif























