/**
 ****************************************************************************************************
 * @file        picviewer.h
 * @version     V1.0
 * @brief       APP-数码相框实现 代码
 ****************************************************************************************************
 * @attention   Waiken-Smart 慧勤智远
 *
 * 实验平台:    慧勤智远 STM32开发板
 *
 ****************************************************************************************************
 */ 

#ifndef __PICVIEWER_H
#define __PICVIEWER_H

#include "common.h"


uint8_t pic_tp_scan(void);
uint8_t picviewer_play(void);

#endif









