/**
 ****************************************************************************************************
 * @file        adc3.h
 * @version     V1.0
 * @brief       ADC3(开启内部温度传感器) 驱动代码
 ****************************************************************************************************
 * @attention   Waiken-Smart 慧勤智远
 *
 * 实验平台:    STM32H747XIH6小系统板
 *
 ****************************************************************************************************
 */

#ifndef __ADC3_H
#define __ADC3_H

#include "./SYSTEM/sys/sys.h"


/******************************************************************************************/
/* ADC3内部温度传感器通道 定义 */ 

#define ADC3_TEMPSENSOR_CHX             18  

/******************************************************************************************/

void adc3_init(void);                                        /* ADC3初始化 */
void adc3_channel_set(uint8_t ch, uint8_t stime);            /* ADC3通道设置采样时间 */
uint32_t adc3_get_result(uint8_t ch);                        /* 获得某个通道的ADC转换结果  */
uint32_t adc3_get_result_average(uint8_t ch, uint8_t times); /* 得到某个通道给定次数采样的平均值 */

short adc3_get_temperature(void);                            /* ADC3获取内部温度传感器的温度值 */

#endif 





