/**
 ****************************************************************************************************
 * @file        dac.h
 * @version     V1.0
 * @brief       DAC 驱动代码
 ****************************************************************************************************
 * @attention   Waiken-Smart 慧勤智远
 *
 * 实验平台:    STM32H747XIH6小系统板
 *
 ****************************************************************************************************
 */

#ifndef __DAC_H
#define __DAC_H

#include "./SYSTEM/sys/sys.h"


extern DAC_HandleTypeDef g_dac_handle;             /* DAC句柄 */

/******************************************************************************************/

void dac_init(uint8_t outx);                       /* DAC通道初始化 */
void dac_set_voltage(uint8_t outx, uint16_t vol);  /* 设置DAC通道1/2输出电压 */

#endif





